---
title: FabricationPartRouteEnd
classe: Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd
namespace: Autodesk.Revit.DB.Fabrication
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# FabricationPartRouteEnd

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `fabricationPartRouteEnd.IsValidObject` | Boolean |
| `FabricationPartRouteEnd CreateFromCenterline(Element, XYZ)` | `FabricationPartRouteEnd.CreateFromCenterline(element, ptAt)` | FabricationPartRouteEnd |
| `FabricationPartRouteEnd CreateFromConnector(Connector)` | `FabricationPartRouteEnd.CreateFromConnector(connnector)` | FabricationPartRouteEnd |
| `Void Dispose()` | `fabricationPartRouteEnd.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```